&НаСервере
Функция ОбновитьСписокСкладов()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Склады.Ссылка КАК Склад,
	|	Склады.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Склады КАК Склады
	|ГДЕ
	|	НЕ Склады.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	Склады.Наименование";
	
	Результат = Запрос.Выполнить();
	
	СписокСкладов.Очистить();
	СписокСкладов.Загрузить(Результат.Выгрузить());
КонецФункции


&НаКлиенте
Процедура ПолучитьСкладыНажатие(Элемент)
	
	ОбновитьСписокСкладов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьФайлНажатие(Команда)
	Диалог = Новый ДиалогВыбораФайла(
		РежимДиалогаВыбораФайла.Открытие
	);
	
	Диалог.Фильтр = "Файлы Excel (*.xlsx)|*.xlsx";
	Диалог.Заголовок = "Выберите файл Excel";
	
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьExcelНажатие(Команда)
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		Сообщить("Сначала выберите Excel-файл.");
		Возврат;
	КонецЕсли;
	
	Попытка
		ТабДок = Новый ТабличныйДокумент;
		ТабДок.Прочитать(
			ПутьКФайлу
		);
	Исключение
		Сообщить("Не удалось прочитать файл: " + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	ДанныеExcel.Очистить();
	
	Для НомерСтроки = 2 По ТабДок.ВысотаТаблицы Цикл
		Артикул = СокрЛП(Строка(ТабДок.Область(
			НомерСтроки, 1).Текст));
			
		Наименование = СокрЛП(Строка(ТабДок.Область(
			НомерСтроки, 2).Текст));
			
		Если ПустаяСтрока(Артикул)
			И ПустаяСтрока(Наименование) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ДанныеExcel.Добавить();
		
		НоваяСтрока.Артикул = Артикул;
		НоваяСтрока.Наименование = Наименование;
		
		НоваяСтрока.Остаток = Число(
			ТабДок.Область(НомерСтроки, 3).Текст);
			
		НоваяСтрока.Закупка = Число(
			ТабДок.Область(НомерСтроки, 4).Текст);
			
		НоваяСтрока.РРЦ = Число(
			ТабДок.Область(НомерСтроки, 5).Текст);
			
	КонецЦикла;
	
	Сообщить("Загрузка завершена.");
	
КонецПроцедуры