#Область ОбработкаСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИнициализироватьТабличныйДокумент();
	
	ОсновнаяЕдиницаИзмеренияВеса 	=Константы.ЕдиницаИзмеренияВеса.Получить();
	ОсновнаяЕдиницаИзмеренияОбъема	=Константы.ЕдиницаИзмеренияОбъема.Получить();
	ОсновнаяЕдиницаИзмеренияДлины   =Константы.ЕдиницаИзмеренияДлины.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область ОбработкаСобытийЭлементовФормы

&НаКлиенте
Процедура ЗагружатьВесогабаритныеРазмерыПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ВариантПоискаНоменклатурыПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура НеобходимоСоздатьНоменклатуруПоставщикаПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Загрузить(Команда)
	Если ВариантПоискаНоменклатуры=0 Тогда	           //// по коду
		ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R2C1").Текст);
	//	Если Не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда
	//		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла. наименование должно быть заполнено обязательно'"));
	//		Возврат;
	//	КонецЕсли;
	ИначеЕсли ВариантПоискаНоменклатуры=1 Тогда	             //// по артикулу
		ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R2C2").Текст);
		Если Не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда
			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла. артикул должен быть заполнен обязательно'"));
			Возврат;
		КонецЕсли;
	ИначеЕсли ВариантПоискаНоменклатуры=2 Тогда	           //// по штрихкоду
		ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R2C3").Текст);
		Если Не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда
			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла. штрихкод должен быть заполнен обязательно'"));
			Возврат;
		КонецЕсли;
	ИначеЕсли ВариантПоискаНоменклатуры=3 Тогда	             //// по наименованию
		ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R2C4").Текст);
		Если Не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда
			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла. наименование должно быть заполнено обязательно'"));
			Возврат;
		КонецЕсли;
	ИначеЕсли ВариантПоискаНоменклатуры=4 Тогда	             //// по дополнительному реквизиту
		ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R2C8").Текст);
		Если Не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда
			ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо скопировать колонки в таблицу из внешнего файла. значение дополнительного реквизита должно быть заполнено обязательно'"));
			Возврат;
		КонецЕсли;
		
	КонецЕсли;

	Если не мДополнительныйРеквизит.Пустая()		Тогда
		ЗаполняемДопРеквизит=Истина;
	КонецЕсли;
	
	мТипЗначенияДопРеквизита = ОпределитьТипЗначения(мДополнительныйРеквизит);
	//Если Строка(мДополнительныйРеквизит.ТипЗначения)  = "Строка" Тогда
	//	мТипЗначенияДопРеквизита = "Строка";
	//ИначеЕсли Строка(мДополнительныйРеквизит.ТипЗначения)  = "Число" Тогда
	//	мТипЗначенияДопРеквизита = "Число";
	//ИначеЕсли Строка(мДополнительныйРеквизит.ТипЗначения)  = "Булево" Тогда
	//	мТипЗначенияДопРеквизита = "Булево";
	//ИначеЕсли Строка(мДополнительныйРеквизит.ТипЗначения) = "Дополнительное значение"  Тогда
	//	мТипЗначенияДопРеквизита = "ДополнительноеЗначение";
	//ИначеЕсли Строка(мДополнительныйРеквизит.ТипЗначения)  = "Дата" Тогда
	//	мТипЗначенияДопРеквизита = "Дата";
	////ИначеЕсли Найти(Строка(мДополнительныйРеквизит.ТипЗначения)  = "Дата" Тогда
	//	//мТипЗначенияДопРеквизита = "Дата";
	//Иначе
	//	мТипЗначенияДопРеквизита = Неопределено;
	//КонецЕсли;
	
	
	Если мТипЗначенияДопРеквизита = Неопределено Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Указан дополнительный реквизит который данной обработкой не поддерживается, выполнение обработки невозможно '"));
		Возврат;
	КонецЕсли;
	

	Если ВариантПоискаНоменклатуры=4 и мДополнительныйРеквизит.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо указать дополнительный реквизит, на закладке (Дополнительные реквизиты) т.к. поиск номенклатуры осуществляется по значению этого реквизита '"));
		Возврат;
	КонецЕсли;
	
			
	ОчиститьСообщения();
	Состояние(НСтр("ru = 'Осуществляется сопоставление введенных данных с данными информационной базы. Пожалуйста подождите...'"),,,БиблиотекаКартинок.Информация32);
	
	Если ВидНоменклатуры.Пустая() Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Необходимо указать вид номенклатуры'"));
		Возврат;
	КонецЕсли;
	
	
	Если Партнер.Пустая() и НеобходимоСоздатьНоменклатуруПоставщика Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Т.к. требуется создавать номенклатуру поставщика, то обязтельно указать поставщика, для которого создается номенклатура'"));
		Возврат;
	КонецЕсли;
	
	//Возврат;
	СопоставитьДанныеТабличногоДокументаСДаннымиИБ();

	Если СписокСозданныхНоменклатур.Количество()>0 Тогда
		
		Элементы.Группа1.ТекущаяСтраница = Элементы.Результат;
	КонецЕсли;
	
	
	ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Обработка завершена'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьБазовыеЕдиницыИзмерения(Команда)
	ВыбратьЕдИзм();
КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции
&НаКлиенте
Процедура УправлениеВидимостью()
	Если ВариантПоискаНоменклатуры=1 Тогда
		ЭтаФорма.Элементы.НеобходимоСоздатьНоменклатуруПоставщика.Доступность = Истина;
	Иначе
		ЭтаФорма.Элементы.НеобходимоСоздатьНоменклатуруПоставщика.Доступность = Ложь;
		НеобходимоСоздатьНоменклатуруПоставщика = Ложь;
	КонецЕсли;
	
	Если ВариантПоискаНоменклатуры=4 Тогда  /// по доп реквизиту
		ЭтаФорма.Элементы.ДополнительныйРеквизит.Видимость 	= Истина;
		ЭтаФорма.Элементы.мПредупреждение.Видимость 		= Истина;

	Иначе
		ЭтаФорма.Элементы.ДополнительныйРеквизит.Видимость 	= Ложь;
		ЭтаФорма.Элементы.мПредупреждение.Видимость 		= Ложь;

	КонецЕсли;
	
	
	
		ВидимостьПараметров = НеобходимоСоздатьНоменклатуруПоставщика ;	
	
		ЭтаФорма.Элементы.ЧтоДелаемСНайденнойНоменклатуройПоставщика.Видимость						=ВидимостьПараметров;
		ЭтаФорма.Элементы.ГруппаЗагрузкиНоменклатурыПоставщиков.Видимость							=ВидимостьПараметров;
		ЭтаФорма.Элементы.Партнер.Видимость															=ВидимостьПараметров;
		ЭтаФорма.Элементы.Производитель.Видимость													=ВидимостьПараметров;
		ЭтаФорма.Элементы.ПропускатьСозданиеНоменклатурыПоставщикаСПустымиНаименованием.Видимость	=ВидимостьПараметров;
		
		ЭтаФорма.Элементы.ПутьККаталогуИзображений.Видимость			=ЗагружаемИзображения;
		ЭтаФорма.Элементы.ЗагружаемуюКартинкуСделатьОсновной.Видимость	=ЗагружаемИзображения;
		
		ЭтаФорма.Элементы.Группа8.Видимость = ЗагружатьВесогабаритныеРазмеры;	
	
КонецПроцедуры

&НаСервере
Процедура СопоставитьДанныеТабличногоДокументаСДаннымиИБ()
	НомерПП = 1;
	ВариантЗаполнения = "";
	СписокСозданныхНоменклатур.Очистить();
	СпрНоменклатура.Очистить();
	СпрГруппыНоменклатуры.Очистить();
	СпрПрисоединённыеФайлы.Очистить();
	СпрНоменклатураПоставщиков.Очистить();
	
	ЗаполнитьТаблицуНоменклатурыИШтрихкодов();
	ТаблицаЗагружаемыхДанных = Новый ТаблицаЗначений;
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("Код");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("Артикул");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("Штрихкод");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("Наименование");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("НаименованиеДляПечати");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("ЕдиницаИзмерения");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("НаименованиеНоменклатурыПоставщика");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("НоменклатураСсылка");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("НоменклатураПоставщикаСсылка");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("НоваяНоменклатура");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("ЗначениеДопРеквизита");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("ФайлКартинки");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("ТекстовоеОписание");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("ГруппаНаименование");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("ГруппаСсылка");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("Вес");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("Объем");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("Длина");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("Ширина");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("Высота");
	ТаблицаЗагружаемыхДанных.Колонки.Добавить("Площадь");
	НомераКолонок = Новый Соответствие;
	НомерКолонки = 1;
	
	НомераКолонок.Вставить("КолонкаКод", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаАртикул", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаШтрихкод", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаНаименование", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаНаименованиДляПечати", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаЕдиницаИзмерения", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаНаименованиеНоменклатурыПоставщика", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаЗначениеДопРеквизита", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаТекстовоеОписание", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаГруппа", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаВес", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаОбъем", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаДлина", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаШирина", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаВысота", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	НомерКолонки = НомерКолонки +1;
	НомераКолонок.Вставить("КолонкаПлощадь", "C" + Формат(НомерКолонки, "ЧН=0; ЧГ=0"));
	
	НомерСтроки = 2;
	СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
	
	Если ВариантПоискаНоменклатуры=0 Тогда /// по коду
		ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКод")).Текст);
	ИначеЕсли ВариантПоискаНоменклатуры=1 Тогда /// по артукулу
		ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст);
		
	ИначеЕсли ВариантПоискаНоменклатуры=2 Тогда /// по штрихкоду
		ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаШтрихкод")).Текст);
		
	ИначеЕсли ВариантПоискаНоменклатуры=3 Тогда /// по наименованию
		
		ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНаименование")).Текст);
	ИначеЕсли ВариантПоискаНоменклатуры=4 Тогда /// по дополнительному реквизиту
		
		ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаЗначениеДопРеквизита")).Текст);
		
	КонецЕсли;
	
		
		
	
		
	ЕстьОшибкиРаспознавания = Ложь;
/// 03062020	
	Пока ЗаполненыНоменклатураКодАртикулШтрихкод Цикл
		Попытка
			Если ВариантПоискаНоменклатуры=0 Тогда /// по коду
				ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКод")).Текст);
			ИначеЕсли ВариантПоискаНоменклатуры=1 Тогда /// по артукулу
				ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст);
				
			ИначеЕсли ВариантПоискаНоменклатуры=2 Тогда /// по штрихкоду
				ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаШтрихкод")).Текст);
				
			ИначеЕсли ВариантПоискаНоменклатуры=3 Тогда /// по наименованию
				ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНаименование")).Текст);
				
			ИначеЕсли ВариантПоискаНоменклатуры=4 Тогда /// по доп. реквизиту
				ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаЗначениеДопРеквизита")).Текст);
			КонецЕсли;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		Если не ЗаполненыНоменклатураКодАртикулШтрихкод Тогда Прервать; КонецЕсли;
		
		НоваяСтрока = ТаблицаЗагружаемыхДанных.Добавить();
		Попытка
			НоваяСтрока.Код		 								= ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКод")).Текст;
			НоваяСтрока.Артикул 								= ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст;
			НоваяСтрока.Штрихкод 								= ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаШтрихкод")).Текст;
			НоваяСтрока.Наименование 							= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНаименование")).Текст);
			НоваяСтрока.ЕдиницаИзмерения						= ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаЕдиницаИзмерения")).Текст;
			НоваяСтрока.НаименованиеДляПечати					= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНаименованиДляПечати")).Текст);
			НоваяСтрока.НаименованиеНоменклатурыПоставщика		= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНаименованиеНоменклатурыПоставщика")).Текст);
			НоваяСтрока.ЗначениеДопРеквизита					= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаЗначениеДопРеквизита")).Текст);
			
			НоваяСтрока.ТекстовоеОписание						= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаТекстовоеОписание")).Текст);
			НоваяСтрока.ГруппаНаименование						= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаГруппа")).Текст);
			Попытка
				ЗначениеВеса 										= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаВес")).Текст);
				ЗначениеВеса 										= ?(ЗначениеВеса="",0,ЗначениеВеса);
				НоваяСтрока.Вес										= Число(ЗначениеВеса);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось прочитать значение вес для позиции "+НоваяСтрока.Наименование);
			КонецПопытки;
			
			Попытка
				ЗначениеОбъем 										= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаОбъем")).Текст);
				ЗначениеОбъем 										= ?(ЗначениеОбъем="",0,ЗначениеОбъем);
				НоваяСтрока.Объем									= Число(ЗначениеОбъем);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось прочитать значение объем для позиции "+НоваяСтрока.Наименование);
			КонецПопытки;
			
			Попытка
				ЗначениеДлина 										= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаДлина")).Текст);
				ЗначениеДлина 										= ?(ЗначениеДлина="",0,ЗначениеДлина);
				НоваяСтрока.Длина									= Число(ЗначениеДлина);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось прочитать значение длины для позиции "+НоваяСтрока.Наименование);
			КонецПопытки;
			
			Попытка
				ЗначениеШирина 										= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаШирина")).Текст);
				ЗначениеШирина 										= ?(ЗначениеШирина="",0,ЗначениеШирина);
				НоваяСтрока.Ширина									= Число(ЗначениеШирина);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось прочитать значение ширины для позиции "+НоваяСтрока.Наименование);
			КонецПопытки;
			
			Попытка
				ЗначениеВысота 										= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаВысота")).Текст);
				ЗначениеВысота 										= ?(ЗначениеВысота="",0,ЗначениеВысота);
				НоваяСтрока.Высота									= Число(ЗначениеВысота);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось прочитать значение высоты для позиции "+НоваяСтрока.Наименование);
			КонецПопытки;
			
			Попытка
				ЗначениеПлощадь 									= СокрЛП(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаПлощадь")).Текст);
				ЗначениеПлощадь 									= ?(ЗначениеПлощадь="",0,ЗначениеПлощадь);
				НоваяСтрока.Площадь									= Число(ЗначениеПлощадь);
			Исключение
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось прочитать значение площади для позиции "+НоваяСтрока.Наименование);
			КонецПопытки;
																				
			Если СокрЛП(НоваяСтрока.ГруппаНаименование)<>"" и РазнестиНоменклатуруПоГруппамУказаннымВДанныхДляЗагрузки Тогда
				НоваяСтрока.ГруппаСсылка = НайтиГруппуТоваров(НоваяСтрока.ГруппаНаименование);
			КонецЕсли;
			

			
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		
		
		
		Если ВариантПоискаНоменклатуры=0 Тогда /// по коду
			СтрокаПоиска        = НоваяСтрока.Код; 
			ВариантПоискаСтрока = "Код";
		ИначеЕсли ВариантПоискаНоменклатуры=1 Тогда /// по артукулу
			СтрокаПоиска        = НоваяСтрока.Артикул; 
			ВариантПоискаСтрока = "Артикул";
		ИначеЕсли ВариантПоискаНоменклатуры=2 Тогда /// по штрихкоду
			СтрокаПоиска		= НоваяСтрока.Штрихкод;
			ВариантПоискаСтрока = "Штрихкод";
		ИначеЕсли ВариантПоискаНоменклатуры=3 Тогда /// по наименованию
			СтрокаПоиска        = НоваяСтрока.Наименование; 
			ВариантПоискаСтрока = "Наименование";
		ИначеЕсли ВариантПоискаНоменклатуры=4 Тогда /// по доп. реквизиту
			СтрокаПоиска        = НоваяСтрока.ЗначениеДопРеквизита; 
			ВариантПоискаСтрока = "ДопРеквизит";
		КонецЕсли;
		
		
		
		//ВариантПоискаСтрока = "";	
		//ВариантПоиска =1;
		//Если ВариантПоиска=1 Тогда   /// Поиск номенклатуры по артикулу
		Если не ЗначениеЗаполнено(СтрокаПоиска) Тогда
			Если ВариантПоискаНоменклатуры=0 Тогда /// по коду
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не укзанан код в строке "+Строка(НомерСтроки)+"  пропускаем");
			ИначеЕсли ВариантПоискаНоменклатуры=1 Тогда /// по артукулу
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не укзанан артикул в строке "+Строка(НомерСтроки)+"  пропускаем");
			ИначеЕсли ВариантПоискаНоменклатуры=2 Тогда /// по штрихкоду
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан штрихкод в строке "+Строка(НомерСтроки)+"  пропускаем");
			ИначеЕсли ВариантПоискаНоменклатуры=3 Тогда /// по наименованию
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан наименование в строке "+Строка(НомерСтроки)+"  пропускаем");
			ИначеЕсли ВариантПоискаНоменклатуры=4 Тогда /// по доп. реквизиту
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не указан наименование в строке "+Строка(НомерСтроки)+"  пропускаем");
			КонецЕсли;
			
			НомерСтроки = НомерСтроки + 1;
			СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
			//Прервать;
		КонецЕсли;
		
		
		СтруктураПоиска = Новый Структура(ВариантПоискаСтрока,СтрокаПоиска);
			
		//КонецЕсли;
		
		
	    НайденнаяНоменклатура = Неопределено;
		НайденныеСтроки = СпрНоменклатура.НайтиСтроки(СтруктураПоиска);
		
		Если НайденныеСтроки.Количество()>0 Тогда
			Если ЧтоДелаемСНайденнымиТоварами=0 Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Пропускаем найденный товар "+НайденныеСтроки[0].Наименование);
				
				НомерСтроки = НомерСтроки + 1;
				СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
				ВыбрНоменклатураДляДобавления = НайденныеСтроки[0].НоменклатураСсылка;
				СтрукрутаПоискаСозданныхНоменклатур = Новый Структура("Номенклатура",ВыбрНоменклатураДляДобавления);
				НайденныеСтрокиСозданныхНоменклатур = СписокСозданныхНоменклатур.НайтиСтроки(СтрукрутаПоискаСозданныхНоменклатур);
				Если НайденныеСтрокиСозданныхНоменклатур.Количество()=0 Тогда
					
					НоваяСтрокаНом = СписокСозданныхНоменклатур.Добавить();
					НоваяСтрокаНом.НомерПП 			= НомерПП;
					НомерПП 						= НомерПП+1;
					НоваяСтрокаНом.Номенклатура 	= ВыбрНоменклатураДляДобавления;
					НоваяСтрока.НоменклатураСсылка 	= ВыбрНоменклатураДляДобавления;
					
					Если НеобходимоСоздатьНоменклатуруПоставщика Тогда
						СозданиеНоменклатурыПоставщика(НоваяСтрока,НоваяСтрокаНом,НомерСтроки);
					КонецЕсли;
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("!! В загружаемых данных есть задвоение артикула "+ВыбрНоменклатураДляДобавления.Артикул );
				КонецЕсли;
				Продолжить;
			Иначе
				НайденнаяНоменклатура = НайденныеСтроки[0].НоменклатураСсылка;
			КонецЕсли;
			
		КонецЕсли;
			
			
		//Если ВариантЗаполнения="РедактированиеНоменклатуры" и НайденнаяНоменклатура=Неопределено Тогда
		//	    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("выбран вариант заполнения (Редактирование номенклатуры), позиция с параметром поиска "+СтруктураПоиска[ВариантПоискаСтрока]+"  пропускаем");
		//		НомерСтроки = НомерСтроки + 1;
		//		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		//		Продолжить;
		//КонецЕсли;
			
///// создаем, редактируем номенклатуру
			Если Не ЗначениеЗаполнено(НайденнаяНоменклатура) Тогда

				РедОбъект = Справочники.Номенклатура.СоздатьЭлемент();
				
				НоваяСтрока.НоваяНоменклатура = Истина;
			Иначе
				РедОбъект = НайденнаяНоменклатура.ПолучитьОбъект();
				НоваяСтрока.НоваяНоменклатура = Ложь;
			КонецЕсли;
			
			
			
			РедОбъект.Наименование 	 		=  НоваяСтрока.Наименование;
			//Если ЗначениеЗаполнено(НоваяСтрока.Код) Тогда
			//	РедОбъект.Код			 		=  НоваяСтрока.Код;
			//КонецЕсли;
			
			Если РазнестиНоменклатуруПоГруппамУказаннымВДанныхДляЗагрузки Тогда
				Если ЗначениеЗаполнено(НоваяСтрока.ГруппаСсылка) Тогда
					РедОбъект.Родитель = НоваяСтрока.ГруппаСсылка;
				Иначе
					РедОбъект.Родитель = ВыбрГруппаДляЗагрузки;
				КонецЕсли;
			Иначе
				Если не ВыбрГруппаДляЗагрузки.Пустая() Тогда
					РедОбъект.Родитель = ВыбрГруппаДляЗагрузки;
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеЗаполнено(НоваяСтрока.Код) Тогда
			РедОбъект.Код							=  НоваяСтрока.Код;
			КонецЕсли;
			РедОбъект.Артикул 						=  НоваяСтрока.Артикул;
			РедОбъект.ВидНоменклатуры				=  ВидНоменклатуры;
			//РедОбъект.ВариантОформленияПродажи		=  ВариантОформленияПродажи;
			РедОбъект.СтавкаНДС						=  СтавкаНДС;
			РедОбъект.ВестиУчетПоГТД				=  ВестиУчетПоГТД;
			РедОбъект.НаименованиеПолное   			=  НоваяСтрока.НаименованиеДляПечати;
			РедОбъект.Качество						=  Качество;
			РедОбъект.Описание					 	=  НоваяСтрока.ТекстовоеОписание;
			РедОбъект.ИспользованиеХарактеристик 	=  ВидНоменклатуры.ИспользованиеХарактеристик;
			РедОбъект.ВариантОформленияПродажи		=  ВидНоменклатуры.ВариантОформленияПродажи;
			РедОбъект.ТипНоменклатуры				=  ВидНоменклатуры.ТипНоменклатуры;
			РедОбъект.ГруппаДоступа				 	=  ВидНоменклатуры.ГруппаДоступа;
			РедОбъект.Производитель					=  Производитель;
			
			
			
			Если ЗагружатьВесогабаритныеРазмеры Тогда
				РедОбъект.ВесИспользовать               =  Истина;
				РедОбъект.ВесЗнаменатель				=  1;
				РедОбъект.ВесЧислитель					=  НоваяСтрока.Вес;
				
				РедОбъект.ОбъемИспользовать             =  Истина;
				РедОбъект.ОбъемЗнаменатель				=  1;
				РедОбъект.ОбъемЧислитель				=  НоваяСтрока.Объем;
				
				РедОбъект.ДлинаИспользовать             =  Истина;
				РедОбъект.ДлинаЗнаменатель				=  1;
				РедОбъект.ДлинаЧислитель				=  НоваяСтрока.Длина;
				
				РедОбъект.ПлощадьИспользовать           =  Истина;
				РедОбъект.ПлощадьЗнаменатель			=  1;
				РедОбъект.ПлощадьЧислитель				=  НоваяСтрока.Площадь;
				
			КонецЕсли;
				
			
			
			Попытка
				
				Если РедОбъект.ЭтоНовый()
					И Не ЗначениеЗаполнено(РедОбъект.Код) Тогда
						РедОбъект.УстановитьНовыйКод();
				КонецЕсли;
				
				РедОбъект.Записать();
				
				НужноДобавить = Ложь;
				Если СписокСозданныхНоменклатур.Количество()=0 Тогда
					НужноДобавить = Истина;
				Иначе
					СтрукрутаПоискаСозданныхНоменклатур = Новый Структура("Номенклатура",РедОбъект.Ссылка);
					НайденныеСтроки = СписокСозданныхНоменклатур.НайтиСтроки(СтрукрутаПоискаСозданныхНоменклатур);
					Если НайденныеСтроки.Количество()=0 Тогда
						НужноДобавить = Истина;
					КонецЕсли;
					
				КонецЕсли;
				
				 Если НужноДобавить Тогда
					НоваяСтрокаНом = СписокСозданныхНоменклатур.Добавить();
					НоваяСтрокаНом.НомерПП = НомерПП;
					НомерПП 			   = НомерПП+1;
					НоваяСтрокаНом.Номенклатура = РедОбъект.Ссылка;
					//Если НоваяСтрока.НоваяНоменклатура Тогда
						НоваяСтрокаНом.НоваяНоменклатура = НоваяСтрока.НоваяНоменклатура;
					//Иначе
						НоваяСтрокаНом.ОтредактированнаяНоменклатура = не НоваяСтрока.НоваяНоменклатура;
					//КонецЕсли;
				Иначе
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("!! В загружаемых данных есть задвоение артикула "+НоваяСтрока.Артикул );
				 КонецЕсли;
			Исключение
				НомерСтроки = НомерСтроки + 1;
				СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
				
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()) + НоваяСтрока.Наименование);

				Продолжить;
				
			КонецПопытки;
			НоваяСтрока.НоменклатураСсылка = РедОбъект.Ссылка;	
			
			
			
			
			Если НоваяСтрока.НоваяНоменклатура или не ЗначениеЗаполнено(НоваяСтрока.НоменклатураСсылка.ЕдиницаИзмерения) Тогда
				СоздаемЕдиницуИзмеренияДляНоменклатуры(НоваяСтрока);
			КонецЕсли;
			Если НеобходимоСоздатьНоменклатуруПоставщика Тогда
				СозданиеНоменклатурыПоставщика(НоваяСтрока,НоваяСтрокаНом,НомерСтроки);
			КонецЕсли;

			Если ЗначениеЗаполнено(НоваяСтрока.Штрихкод) Тогда       //// если указан в загрузке ШК
			НетШК = КонтрольНаличияШтрихкодаУДругихНоменклатур(НоваяСтрока.Штрихкод,НоваяСтрока.НоменклатураСсылка);
			
			
				Если НетШК  Тогда /// и он не пренадлежит другой номенклатуре, то регистрируем его
						НаборЗаписей = РегистрыСведений.ШтрихкодыНоменклатуры.СоздатьНаборЗаписей(); 
						НаборЗаписей.Отбор.Штрихкод.Установить(НоваяСтрока.Штрихкод); 
						
							НоваяЗапись = НаборЗаписей.Добавить(); 
							НоваяЗапись.Штрихкод   		= НоваяСтрока.Штрихкод;
							НоваяЗапись.Номенклатура 	= НоваяСтрока.НоменклатураСсылка;
							НоваяЗапись.Характеристика	= Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(); 
							НоваяЗапись.Упаковка		= НоваяСтрока.НоменклатураСсылка.ЕдиницаИзмерения;
						
						НаборЗаписей.Записать(Истина); 
				КонецЕсли;
			КонецЕсли;
			Если ЗаполняемДопРеквизит Тогда
				Если ЗначениеЗаполнено(НоваяСтрока.ЗначениеДопРеквизита) Тогда       //// если заполнено доп свойство
					  ЗаполнитьДопРеквизит(НоваяСтрока.НоменклатураСсылка,мДополнительныйРеквизит,НоваяСтрока.ЗначениеДопРеквизита);
				КонецЕсли;
			КонецЕсли;
			Если ЗагружаемИзображения и СокрЛП(НоваяСтрока.Артикул)<>"" Тогда
				 ЗагрузкаИзображения(НоваяСтрока);
			КонецЕсли;
			
			Если НоваяСтрока.НоваяНоменклатура Тогда
				ДобавитьНоменклатуруВСпрНоменклатура(НоваяСтрока.НоменклатураСсылка);
			КонецЕсли;
			
			
			Если ЗагружатьВесогабаритныеРазмеры Тогда
				
				МассивСтруктур = Новый Массив;
				Если не ДополнительныйРеквизитВес.Пустая() Тогда
					МассивСтруктур.Добавить(Новый Структура("Свойство, Значение",ДополнительныйРеквизитВес,НоваяСтрока.Вес));
				КонецЕсли;
				Если не ДополнительныйРеквизитВысота.Пустая() Тогда
					МассивСтруктур.Добавить(Новый Структура("Свойство, Значение",ДополнительныйРеквизитВысота,НоваяСтрока.Высота));
				КонецЕсли;
				
				Если не ДополнительныйРеквизитДлина.Пустая() Тогда
					МассивСтруктур.Добавить(Новый Структура("Свойство, Значение",ДополнительныйРеквизитДлина,НоваяСтрока.Длина));
				КонецЕсли;
				Если не ДополнительныйРеквизитОбъем.Пустая() Тогда
					МассивСтруктур.Добавить(Новый Структура("Свойство, Значение",ДополнительныйРеквизитОбъем,НоваяСтрока.Объем));
				КонецЕсли;
				Если не ДополнительныйРеквизитПлощадь.Пустая() Тогда
					МассивСтруктур.Добавить(Новый Структура("Свойство, Значение",ДополнительныйРеквизитПлощадь,НоваяСтрока.Площадь));
				КонецЕсли;
				Если не ДополнительныйРеквизитШирина.Пустая() Тогда
					МассивСтруктур.Добавить(Новый Структура("Свойство, Значение",ДополнительныйРеквизитШирина,НоваяСтрока.Ширина));
				КонецЕсли;
				УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(НоваяСтрока.НоменклатураСсылка,МассивСтруктур);				
	
				
			КонецЕсли;
			
			
		НомерСтроки = НомерСтроки + 1;
		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		
		Попытка
			ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст)
			//ЗаполненыНоменклатураКодАртикулШтрихкод = ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаАртикул")).Текст)
				Или ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаНаименование")).Текст)
				Или ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаЗначениеДопРеквизита")).Текст)
				Или ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаШтрихкод")).Текст)
				Или ЗначениеЗаполнено(ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + НомераКолонок.Получить("КолонкаКод")).Текст);
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
		//Прервать;
	КонецЦикла;
	СпрНоменклатура.Очистить();
	СпрНоменклатураПоставщиков.Очистить();

	ТаблицаЗагружаемыхДанных.Очистить();
	СпрПрисоединённыеФайлы.Очистить();
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура СообщитьПользователю(Текст, ПутьКДанным = "")
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = Текст;
	Сообщение.ПутьКДанным = ПутьКДанным;
	Сообщение.Сообщить();
	
КонецПроцедуры

&НаСервере
Функция ОпределитьТипЗначения(смДополнительныйРеквизит)
	
	смТипЗначенияДопРеквизита = Неопределено;
	
	Если Строка(мДополнительныйРеквизит.ТипЗначения)  = "Строка" Тогда
		смТипЗначенияДопРеквизита = "Строка";
	ИначеЕсли Строка(мДополнительныйРеквизит.ТипЗначения)  = "Число" Тогда
		смТипЗначенияДопРеквизита = "Число";
	ИначеЕсли Строка(мДополнительныйРеквизит.ТипЗначения)  = "Булево" Тогда
		смТипЗначенияДопРеквизита = "Булево";
	ИначеЕсли Строка(мДополнительныйРеквизит.ТипЗначения) = "Дополнительное значение"  Тогда
		смТипЗначенияДопРеквизита = "ДополнительноеЗначение";
	ИначеЕсли Строка(мДополнительныйРеквизит.ТипЗначения)  = "Дата" Тогда
		смТипЗначенияДопРеквизита = "Дата";
	//ИначеЕсли Найти(Строка(мДополнительныйРеквизит.ТипЗначения)  = "Дата" Тогда
		//мТипЗначенияДопРеквизита = "Дата";
	Иначе
		смТипЗначенияДопРеквизита = Неопределено;
	КонецЕсли;
	
	Возврат смТипЗначенияДопРеквизита;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьТабличныйДокумент()
	
	
	ТекущаяОбработка			=	РеквизитФормыВЗначение("Объект");
    МакетЗаполнения 			= 	ТекущаяОбработка.ПолучитьМакет("Макет"); 	
	
	
	ДанныеДляЗагрузки.Очистить();
	
	
	
	ОбластьШапка = МакетЗаполнения.ПолучитьОбласть("Шапка");
	ДанныеДляЗагрузки.Вывести(ОбластьШапка);
	
	
	//ОбластьПримера = МакетЗаполнения.ПолучитьОбласть("Пример");
	//ДанныеДляЗагрузки.Вывести(ОбластьПримера);
	
	ДанныеДляЗагрузки.ФиксацияСверху = 1;
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуНоменклатурыИШтрихкодов()
///// Выбираем номенклатуру
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Спр_Номенклатура.Ссылка КАК НоменклатураСсылка,
		|	Спр_Номенклатура.Код КАК Код,
		|	Спр_Номенклатура.Наименование КАК Наименование,
		|	Спр_Номенклатура.Артикул КАК Артикул,
		|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, """") КАК Штрихкод,
		|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка, """") КАК Упаковка,
		|	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение.Наименование, """") КАК ДопРеквизит,
		|	Спр_Номенклатура.ФайлКартинки КАК ФайлКартинки
		|ИЗ
		|	Справочник.Номенклатура КАК Спр_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (ШтрихкодыНоменклатуры.Номенклатура = Спр_Номенклатура.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО Спр_Номенклатура.Ссылка = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство = &мДополнительныйРеквизит)
		|			
		|ГДЕ
		|	Спр_Номенклатура.ЭтоГруппа = ЛОЖЬ";
	Запрос.УстановитьПараметр("мДополнительныйРеквизит",мДополнительныйРеквизит);
	
	
	Если не мТипЗначенияДопРеквизита="ДополнительноеЗначение" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"НоменклатураДополнительныеРеквизиты.Значение.Наименование","НоменклатураДополнительныеРеквизиты.Значение");
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаТЧ = СпрНоменклатура.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ,ВыборкаДетальныеЗаписи);
		НоваяСтрокаТЧ.Код = СокрЛП(НоваяСтрокаТЧ.Код);
		
	КонецЦикла;
	
	
///// Выбираем штрихкода номенклатуры

//// Выбириаем номенклатуру  поставщиков
Если НеобходимоСоздатьНоменклатуруПоставщика Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПоставщиков.Ссылка КАК НоменклатураПоставщиковСсылка,
		|	НоменклатураПоставщиков.Код КАК Код,
		|	НоменклатураПоставщиков.Номенклатура КАК Наименование,
		|	НоменклатураПоставщиков.Артикул КАК Артикул,
		|	НоменклатураПоставщиков.Владелец КАК Владелец,
		|	НоменклатураПоставщиков.Номенклатура КАК Номенклатура
		|ИЗ
		|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
		|ГДЕ
		|	НоменклатураПоставщиков.ЭтоГруппа = ЛОЖЬ
		|	И НоменклатураПоставщиков.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец",Партнер);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СпрНоменклатураПоставщиков.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецЕсли;	
	

//// Выбираем присоеднинённые файлы для номенкатуры
Если ЗагружаемИзображения Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НоменклатураПрисоединенныеФайлы.Ссылка КАК СсылкаНаКартинку,
		|	НоменклатураПрисоединенныеФайлы.Наименование КАК Наименование,
		|	НоменклатураПрисоединенныеФайлы.ВладелецФайла КАК ВладелецФайла,
		|	НоменклатураПрисоединенныеФайлы.Размер КАК Размер,
		|	НоменклатураПрисоединенныеФайлы.Расширение КАК Расширение
		|ИЗ
		|	Справочник.НоменклатураПрисоединенныеФайлы КАК НоменклатураПрисоединенныеФайлы
		|ГДЕ
		|	НоменклатураПрисоединенныеФайлы.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СпрПрисоединённыеФайлы.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецЕсли;	

//// Выбираем группы номенкатуры
Если РазнестиНоменклатуруПоГруппамУказаннымВДанныхДляЗагрузки Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Группа,
		|	Номенклатура.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	НЕ Номенклатура.ПометкаУдаления
		|	И Номенклатура.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(СпрГруппыНоменклатуры.Добавить(),ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецЕсли;	





КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДопРеквизит(НоменклатураСсылка,ВыбрДополнительныйРеквизит,ЗначениеДопРеквизита)
	Если мТипЗначенияДопРеквизита="ДополнительноеЗначение" Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗначенияСвойствОбъектов.Ссылка КАК Ссылка,
			|	ЗначенияСвойствОбъектов.Наименование КАК Наименование
			|ИЗ
			|	Справочник.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
			|ГДЕ
			|	ЗначенияСвойствОбъектов.Владелец = &Владелец
			|	И ЗначенияСвойствОбъектов.Наименование = &Наименование";
		
		Запрос.УстановитьПараметр("Владелец", ВыбрДополнительныйРеквизит);
		Запрос.УстановитьПараметр("Наименование", ЗначениеДопРеквизита);
		
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		
		Если  РезультатЗапроса.Количество()=0 Тогда
			НовыйЭлемент = Справочники.ЗначенияСвойствОбъектов.СоздатьЭлемент();
			НовыйЭлемент.Наименование = ЗначениеДопРеквизита;
			НовыйЭлемент.Владелец = ВыбрДополнительныйРеквизит;
			НовыйЭлемент.Записать();
			ВыбрЗначение = НовыйЭлемент.Ссылка;
		Иначе
			ВыбрЗначение = РезультатЗапроса[0].Ссылка; 
		КонецЕсли;
	Иначе
		Если мТипЗначенияДопРеквизита="Дата" Тогда
			Попытка
				ПромСтрокаСДатой = СтрЗаменить(ЗначениеДопРеквизита,".","");
				ВыбрЗначение = Дата(Прав(ПромСтрокаСДатой,4),Сред(ПромСтрокаСДатой,3,2),Лев(ПромСтрокаСДатой,2));
			Исключение
			    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для номенклатуры  "+Строка(НоменклатураСсылка)+"  не удвлось прочитать значение дополнительного реквизита "+ЗначениеДопРеквизита);
				Возврат;
			КонецПопытки;
		ИначеЕсли мТипЗначенияДопРеквизита="Число" Тогда 
			Попытка
				ВыбрЗначение = Число(ЗначениеДопРеквизита);
			Исключение
			    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для номенклатуры  "+Строка(НоменклатураСсылка)+"  не удвлось прочитать значение дополнительного реквизита "+ЗначениеДопРеквизита);
				Возврат;
			КонецПопытки;
		ИначеЕсли мТипЗначенияДопРеквизита="Булево" Тогда 
			Если  Врег(ЗначениеДопРеквизита)="ИСТИНА" или Врег(ЗначениеДопРеквизита)="ДА" или Врег(ЗначениеДопРеквизита)="TRUE" Тогда
				ВыбрЗначение = Истина;
			КонецЕсли;
			
			Если  Врег(ЗначениеДопРеквизита)="ЛОЖЬ" или Врег(ЗначениеДопРеквизита)="НЕТ" или Врег(ЗначениеДопРеквизита)="FALSE" Тогда
				ВыбрЗначение = Ложь;
			КонецЕсли;
			
		ИначеЕсли мТипЗначенияДопРеквизита="Строка" Тогда 
			ВыбрЗначение = ЗначениеДопРеквизита;
		Иначе
			ВыбрЗначение =Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	//Возврат;
	Если ЗначениеЗаполнено(ВыбрЗначение) Тогда
		 СтруктураОтбора = Новый Структура("Свойство, Значение",ВыбрДополнительныйРеквизит,ВыбрЗначение);
		 НоменклатураОбъект = НоменклатураСсылка.ПолучитьОбъект();
		 //НоменклатураОбъект.ДополнительныеРеквизиты.Очистить();
		 НайденныеСтроки = НоменклатураОбъект.ДополнительныеРеквизиты.НайтиСтроки(СтруктураОтбора);
		 
		 Если НайденныеСтроки.Количество()=0 Тогда
			 НоваяСтрокаДопРеквизитов = НоменклатураОбъект.ДополнительныеРеквизиты.Добавить();
		 Иначе
			 //НоваяСтрокаДопРеквизитов = НайденныеСтроки[0];
			 //Если НайденныеСтроки.Количество()>1 Тогда
			 Для каждого ВыбрСтрока из НайденныеСтроки Цикл
				 НоменклатураОбъект.ДополнительныеРеквизиты.Удалить(ВыбрСтрока);
				 
			 КонецЦикла;
			 НоваяСтрокаДопРеквизитов = НоменклатураОбъект.ДополнительныеРеквизиты.Добавить();
			 //    
			 //    
			 //КонецЕсли;
			 
		 КонецЕсли;
		 НоваяСтрокаДопРеквизитов.Свойство = ВыбрДополнительныйРеквизит;
		 НоваяСтрокаДопРеквизитов.Значение = ВыбрЗначение;
		 НоменклатураОбъект.Записать();
		 
	КонецЕсли;
	
		
	
	
КонецПроцедуры

#КонецОбласти

#Область РаботаССправочниками

&НаСервере
Процедура ВыбратьЕдИзм()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка,
		|	УпаковкиЕдиницыИзмерения.Владелец КАК Владелец,
		|	УпаковкиЕдиницыИзмерения.Родитель КАК Родитель,
		|	УпаковкиЕдиницыИзмерения.Код КАК Код,
		|	УпаковкиЕдиницыИзмерения.Наименование КАК Наименование,
		|	УпаковкиЕдиницыИзмерения.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	УпаковкиЕдиницыИзмерения.НаименованиеПолное КАК НаименованиеПолное,
		|	УпаковкиЕдиницыИзмерения.МеждународноеСокращение КАК МеждународноеСокращение,
		|	УпаковкиЕдиницыИзмерения.ТипУпаковки КАК ТипУпаковки,
		|	УпаковкиЕдиницыИзмерения.Предопределенный КАК Предопределенный,
		|	УпаковкиЕдиницыИзмерения.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|ГДЕ
		|	УпаковкиЕдиницыИзмерения.Владелец.Код ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сообщить(Строка(ТипЗнч(ВыборкаДетальныеЗаписи.Владелец))+"   "+Строка(ВыборкаДетальныеЗаписи.Владелец));
	КонецЦикла;
	
	
	
	
	
КонецПроцедуры

&НаСервере
Функция ПоискБазовойЕдиницыИзмерения(СтрокаПоиска)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УпаковкиЕдиницыИзмерения.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УпаковкиЕдиницыИзмерения КАК УпаковкиЕдиницыИзмерения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НаборыУпаковок КАК НаборыУпаковок
		|		ПО УпаковкиЕдиницыИзмерения.Владелец = НаборыУпаковок.Ссылка
		|ГДЕ
		|	НаборыУпаковок.Ссылка = ЗНАЧЕНИЕ(Справочник.НаборыУпаковок.БазовыеЕдиницыИзмерения)
		|	И УпаковкиЕдиницыИзмерения.Код ПОДОБНО &Код";
	
	Если ВариантПоискаЕдиницыИзмерения=0 Тогда
		Запрос.УстановитьПараметр("Код",СтрокаПоиска+"%");
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И УпаковкиЕдиницыИзмерения.Код ПОДОБНО &Код", "И УпаковкиЕдиницыИзмерения.Наименование ПОДОБНО &Наименование");
		Запрос.УстановитьПараметр("Наименование",СтрокаПоиска);
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВыбрЕдиницаИзмерения = ВыборкаДетальныеЗаписи.Ссылка;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ВыбрЕдиницаИзмерения) Тогда
	Иначе
		Если ВариантПоискаЕдиницыИзмерения=0 Тогда
			ТекстОшибки = "Единица измерения с кодом  "+Строка(СтрокаПоиска)+"  не найдена в классификаторе";
		Иначе
			ТекстОшибки = "Единица измерения с наименованием  "+Строка(СтрокаПоиска)+"  не найдена в классификаторе";
		КонецЕсли;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		Возврат Неопределено;
	КонецЕсли;
    Возврат ВыбрЕдиницаИзмерения;
	
КонецФункции

&НаСервере
Процедура СоздаемЕдиницуИзмеренияДляНоменклатуры(НоваяСтрока)
	
	Если СокрЛП(НоваяСтрока.ЕдиницаИзмерения)="" Тогда
		НайденнаяЕдиницаИзмерения  =	 ЕдиницаИзмерения;
	Иначе
		НайденнаяЕдиницаИзмерения  =     ПоискБазовойЕдиницыИзмерения(НоваяСтрока.ЕдиницаИзмерения);
	КонецЕсли;
	
	
	
	//Если ЗначениеЗаполнено(НайденнаяЕдиницаИзмерения) Тогда
	//	НоваяЕдиницаИзмерения = Справочники.УпаковкиЕдиницыИзмерения.СоздатьЭлемент();
	//	НоваяЕдиницаИзмерения.Наименование 				= НайденнаяЕдиницаИзмерения.Наименование+" (1 "+НайденнаяЕдиницаИзмерения.Наименование+")";
	//	НоваяЕдиницаИзмерения.Владелец	   				= НоваяСтрока.НоменклатураСсылка;
	//	НоваяЕдиницаИзмерения.Числитель	  				= 1;
	//	НоваяЕдиницаИзмерения.Знаменатель  				= 1;
	//	НоваяЕдиницаИзмерения.ТипУпаковки  				= Перечисления.ТипыУпаковокНоменклатуры.Конечная;
	//	НоваяЕдиницаИзмерения.ЕдиницаИзмерения			= НайденнаяЕдиницаИзмерения;
	//	//НоваяЕдиницаИзмерения.Безразмерная			= Истина;
	//	НоваяЕдиницаИзмерения.ВесЕдиницаИзмерения 		= ОсновнаяЕдиницаИзмеренияВеса;	
	//	НоваяЕдиницаИзмерения.ШиринаЕдиницаИзмерения	= ОсновнаяЕдиницаИзмеренияДлины;	
	//	НоваяЕдиницаИзмерения.ОбъемЕдиницаИзмерения		= ОсновнаяЕдиницаИзмеренияОбъема;	
	//	НоваяЕдиницаИзмерения.ТипУпаковки				= Перечисления.ТипыУпаковокНоменклатуры.Конечная;
	//	НоваяЕдиницаИзмерения.Объем						= 0.1;	
	//	
	//	НоваяЕдиницаИзмерения.ОбменДанными.Загрузка	= Истина;
	//	Попытка
	//		НоваяЕдиницаИзмерения.Записать();
	//	Исключение
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	//	КонецПопытки;
	//Иначе
	//		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Базовая единица измерения с параметром поиска "+НоваяСтрока.ЕдиницаИзмерения+" в базе не найдена, создание единицы измерения для номенклатуры "+СокрЛП(НоваяСтрока.НоменклатураСсылка)+"  прекращено!");
	//		Возврат;
	//	
	//КонецЕсли;
	
	ВыбрНоменклатураОбъект = НоваяСтрока.НоменклатураСсылка.ПолучитьОбъект();
	ВыбрНоменклатураОбъект.ЕдиницаИзмерения = НайденнаяЕдиницаИзмерения;
	Попытка
		ВыбрНоменклатураОбъект.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
	
	///// Добавляем набор упаковок номенклатуре
	
	
	
	
КонецПроцедуры

&НаСервере
Функция НайтиГруппуТоваров(ГруппаНаименование)
	Если ГруппаНаименование="" или ГруппаНаименование=Неопределено Тогда
		Возврат Справочники.Номенклатура.ПустаяСсылка();
	КонецЕсли;
	
	Структура = Новый Структура("Наименование",ГруппаНаименование);
	НайденныеСтроки = СпрГруппыНоменклатуры.НайтиСтроки(Структура);
	
	Если НайденныеСтроки.Количество()>0 Тогда
		НайденнаяГруппа = НайденныеСтроки[0].Группа; 
	Иначе
		Если СоздаватьНенайденныеГруппы Тогда
			НоваяГруппа = Справочники.Номенклатура.СоздатьГруппу();
			НоваяГруппа.Наименование = ГруппаНаименование;
			
			Если не ВыбрГруппаДляЗагрузки.Пустая() Тогда
				НоваяГруппа.Родитель = ВыбрГруппаДляЗагрузки;
			КонецЕсли;
			
			НоваяГруппа.Записать();
			
			НайденнаяГруппа = НоваяГруппа.Ссылка;
			
			НоваяСтрокаГрупп = СпрГруппыНоменклатуры.Добавить();
			
			НоваяСтрокаГрупп.Группа = НоваяГруппа.Ссылка;
			НоваяСтрокаГрупп.Наименование = ГруппаНаименование;
		Иначе
			НайденнаяГруппа = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
	
	КонецЕсли;
	
	Возврат НайденнаяГруппа;
	
		
КонецФункции

&НаСервере
Процедура СозданиеНоменклатурыПоставщика(НоваяСтрока,НоваяСтрокаНом,НомерСтроки)
	
			НайденнаяНоменклатураПоставщика= Неопределено; 
			НоваяНоменклатураПоставщика = Ложь;
			
			Если НеобходимоСоздатьНоменклатуруПоставщика Тогда
				Если ПропускатьСозданиеНоменклатурыПоставщикаСПустымиНаименованием и  СокрЛП(НоваяСтрока.НаименованиеНоменклатурыПоставщика)="" Тогда
					
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для товара не заполнено наименование поставщика "+Строка(НоваяСтрока.НоменклатураСсылка)+", Отмена, создание номенклатуры поставщику, для данной номенклатуры ");
					Возврат;
				КонецЕсли;
				Если НоваяСтрока.Артикул="" Тогда 
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для товара " +Строка(НоваяСтрока.НоменклатураСсылка)+ "не указан  артикул в данных для загрузки.  Создать номенклатуру поставщика, для данной номенклатуры невозможно");
					Возврат; 
				КонецЕсли;
				СтруктураПоиска = Новый Структура("Артикул,Номенклатура",НоваяСтрока.Артикул,НоваяСтрока.НоменклатураСсылка);
				НайденныеСтрокиНомПост = СпрНоменклатураПоставщиков.НайтиСтроки(СтруктураПоиска);
				Если НайденныеСтрокиНомПост.Количество()=0 ТОгда
					НайденнаяНоменклатураПоставщика =  Справочники.НоменклатураПоставщиков.СоздатьЭлемент();
					НоваяНоменклатураПоставщика 	= Истина;
				Иначе
					Если ЧтоДелаемСНайденнойНоменклатуройПоставщика=1 Тогда
						НоваяСтрокаНом.НоменклатураПоставщика = НайденныеСтрокиНомПост[0].НоменклатураПоставщиковСсылка;

						НайденнаяНоменклатураПоставщика = Неопределено;
					Иначе
						НайденнаяНоменклатураПоставщика = НайденныеСтрокиНомПост[0].НоменклатураПоставщиковСсылка.ПолучитьОбъект();
					КонецЕсли;
				КонецЕсли;
				
				
			КонецЕсли;
			
			Если НайденнаяНоменклатураПоставщика= Неопределено Тогда 
				//НомерСтроки = НомерСтроки + 1;
				//СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
				//
				Возврат 
			КонецЕсли;
			
			
			ЗаполнитьЗначенияСвойств(НайденнаяНоменклатураПоставщика,НоваяСтрокаНом.Номенклатура);
			НайденнаяНоменклатураПоставщика.Владелец		= Партнер;
			НайденнаяНоменклатураПоставщика.Номенклатура	= НоваяСтрокаНом.Номенклатура;
			НайденнаяНоменклатураПоставщика.Родитель		= ГруппаЗагрузкиНоменклатурыПоставщиков;
			НайденнаяНоменклатураПоставщика.Наименование	= НоваяСтрока.НаименованиеНоменклатурыПоставщика;
			НайденнаяНоменклатураПоставщика.Код 			= "";

			
			Попытка
				
			
				Если НайденнаяНоменклатураПоставщика.ЭтоНовый()
					И Не ЗначениеЗаполнено(НайденнаяНоменклатураПоставщика.Код) Тогда
						НайденнаяНоменклатураПоставщика.УстановитьНовыйКод();
				КонецЕсли;
				
				НайденнаяНоменклатураПоставщика.Записать();
				НоваяСтрокаНом.НоменклатураПоставщика = НайденнаяНоменклатураПоставщика.Ссылка;
				
				Если НоваяНоменклатураПоставщика Тогда
					НоваяСтрокаСпрНоменклатураПоставщиков = СпрНоменклатураПоставщиков.Добавить();
					НоваяСтрокаСпрНоменклатураПоставщиков.НоменклатураПоставщиковСсылка = НайденнаяНоменклатураПоставщика.Ссылка;
					НоваяСтрокаСпрНоменклатураПоставщиков.Владелец						= Партнер;
					НоваяСтрокаСпрНоменклатураПоставщиков.Код							= "";
					НоваяСтрокаСпрНоменклатураПоставщиков.Артикул						= НайденнаяНоменклатураПоставщика.Артикул;
					//НоваяСтрокаСпрНоменклатураПоставщиков.Наименование					= "";
					НоваяСтрокаСпрНоменклатураПоставщиков.Наименование					= НайденнаяНоменклатураПоставщика.Наименование;
					НоваяСтрокаСпрНоменклатураПоставщиков.Номенклатура					= НайденнаяНоменклатураПоставщика.Номенклатура;
				КонецЕсли;
				
				
			Исключение
				//НомерСтроки = НомерСтроки + 1;
				//СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
				//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				Возврат;
			КонецПопытки;
	
	
	
КонецПроцедуры

&НаСервере
Функция КонтрольНаличияШтрихкодаУДругихНоменклатур(Штрихкод,Номенклатура)
	
	СтруктураПоиска = Новый Структура("Штрихкод",Штрихкод);
	НайденныеСтроки = СпрНоменклатура.НайтиСтроки(СтруктураПоиска);
	НетШтрихкода = Истина; 
	Если НайденныеСтроки.Количество()=0 Тогда НетШтрихкода = Истина; 
	Иначе
		Если НайденныеСтроки[0].НоменклатураСсылка<>Номенклатура Тогда
			 НетШтрихкода = Ложь;
		    ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Попытка присвоить штрихкод "+Штрихкод+"  номенклатуре "+Строка(Номенклатура)+" принадлежит другой номенклатуре" + Строка(НайденныеСтроки[0].НоменклатураСсылка)  +", присвоение штрихкода пропускаем");
		КонецЕсли;
		 
		
		
		
	КонецЕсли;

	Возврат НетШтрихкода;
	
КонецФункции

&НаСервере
Процедура ДобавитьНоменклатуруВСпрНоменклатура(ВыбрНоменклатура)
	
	Если ВыбрНоменклатура=Неопределено Тогда Возврат; КонецЕсли;
///// Выбираем номенклатуру
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Спр_Номенклатура.Ссылка КАК НоменклатураСсылка,
		|	Спр_Номенклатура.Код КАК Код,
		|	Спр_Номенклатура.Наименование КАК Наименование,
		|	Спр_Номенклатура.Артикул КАК Артикул,
		|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Штрихкод, """") КАК Штрихкод,
		|	ЕСТЬNULL(ШтрихкодыНоменклатуры.Упаковка, """") КАК Упаковка,
		|	ЕСТЬNULL(НоменклатураДополнительныеРеквизиты.Значение.Наименование, """") КАК ДопРеквизит,
		|	Спр_Номенклатура.ФайлКартинки КАК ФайлКартинки
		|ИЗ
		|	Справочник.Номенклатура КАК Спр_Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|		ПО (ШтрихкодыНоменклатуры.Номенклатура = Спр_Номенклатура.Ссылка)
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ПО Спр_Номенклатура.Ссылка = НоменклатураДополнительныеРеквизиты.Ссылка
		|			И (НоменклатураДополнительныеРеквизиты.Свойство = &мДополнительныйРеквизит)
		|ГДЕ
		|	Спр_Номенклатура.ЭтоГруппа = ЛОЖЬ
		|	И Спр_Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("мДополнительныйРеквизит",мДополнительныйРеквизит);
	Запрос.УстановитьПараметр("Ссылка",ВыбрНоменклатура);
	
	
	Если не мТипЗначенияДопРеквизита="ДополнительноеЗначение" Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"НоменклатураДополнительныеРеквизиты.Значение.Наименование","НоменклатураДополнительныеРеквизиты.Значение");
	КонецЕсли;
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтруктураПоиска = Новый Структура("НоменклатураСсылка",ВыборкаДетальныеЗаписи.НоменклатураСсылка);
		НайденныеСтроки = СпрНоменклатура.НайтиСтроки(СтруктураПоиска);
		Если НайденныеСтроки.Количество()=0 Тогда
			НоваяСтрокаТЧ = СпрНоменклатура.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТЧ,ВыборкаДетальныеЗаписи);
			НоваяСтрокаТЧ.Код = СокрЛП(НоваяСтрокаТЧ.Код);
		КонецЕсли;
	КонецЦикла;
	
	
	
КонецПроцедуры

#КонецОбласти

#Область РаботаСФайломИзображения

&НаСервере
Процедура ЗагрузкаИзображения(НоваяСтрока)
	Если СокрЛП(ПутьККаталогуИзображений)="" или СокрЛП(НоваяСтрока.Артикул)="" Тогда Возврат; КонецЕсли;
	ЧастьИмениФайла = СокрЛП(НоваяСтрока.Артикул);
	Файлы = НайтиФайлы(ПутьККаталогуИзображений,ЧастьИмениФайла+".*",Истина);
	Если Файлы.Количество()=0 Тогда Возврат; КонецЕсли;
	СтрокаДанныхПоФайлу 	= Файлы[0];
	ИмяФайлаБезРасширения 	= СтрокаДанныхПоФайлу.ИмяБезРасширения;
	ИмяФайлаСРасширением 	= СтрокаДанныхПоФайлу.Имя;
	ПолныйПутьККартинке     = СтрокаДанныхПоФайлу.ПолноеИмя;
	ПоискФайлаВБазе 		= ПоискИзображения(ИмяФайлаБезРасширения, НоваяСтрока.НоменклатураСсылка);
	
	Если ПоискФайлаВБазе=Справочники.НоменклатураПрисоединенныеФайлы.ПустаяСсылка() Тогда
		
		ДвоичныеДанные = Новый ДвоичныеДанные(ПолныйПутьККартинке);
		АдресВременногоХранилищаФайла = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
		
		ПараметрыФайла = Новый Структура();
		ПараметрыФайла.Вставить("ВладелецФайлов",НоваяСтрока.НоменклатураСсылка);
		ПараметрыФайла.Вставить("ИмяБезРасширения",СтрокаДанныхПоФайлу.ИмяБезРасширения);
		ПараметрыФайла.Вставить("РасширениеБезТочки",СтрЗаменить(СтрокаДанныхПоФайлу.Расширение,".",""));
		ПараметрыФайла.Вставить("ВремяИзмененияУниверсальное",ТекущаяДата());
		ПараметрыФайла.Вставить("Автор",ПользователиКлиентСервер.ТекущийПользователь());
		ПрисоединенныйФайл = РаботаСФайлами.ДобавитьФайл(ПараметрыФайла,
															  АдресВременногоХранилищаФайла,
															  "",
															  "",
															  Неопределено);		
				
		Если ЗагружаемуюКартинкуСделатьОсновной И ЗначениеЗаполнено(ПрисоединенныйФайл) Тогда
			РедОбъект  				= НоваяСтрока.НоменклатураСсылка.ПолучитьОбъект();
			РедОбъект.ФайлКартинки  = ПрисоединенныйФайл.Ссылка; 
			РедОбъект.Записать();
		Иначе
			Сообщить("Не удалось добавить в базу файл "+ПолныйПутьККартинке);
		КонецЕсли;

	Иначе
		Если ЗагружаемуюКартинкуСделатьОсновной и НоваяСтрока.НоменклатураСсылка.ФайлКартинки  <> ПоискФайлаВБазе.СсылкаНаКартинку Тогда
			РедОбъект  				= НоваяСтрока.НоменклатураСсылка.ПолучитьОбъект();
			РедОбъект.ФайлКартинки  = ПоискФайлаВБазе.СсылкаНаКартинку; 
			РедОбъект.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПоискИзображения(ИмяФайла, ВладелецФайла)
	
СтруктураОтбора = Новый Структура("Наименование,ВладелецФайла",ИмяФайла,ВладелецФайла);

НайденныеСтроки = СпрПрисоединённыеФайлы.НайтиСтроки(СтруктураОтбора);
Если НайденныеСтроки.Количество()=0 Тогда
	 НайденнаяПозиция = Справочники.НоменклатураПрисоединенныеФайлы.ПустаяСсылка();
 Иначе
	 НайденнаяПозиция = НайденныеСтроки[0];
КонецЕсли;
Возврат НайденнаяПозиция;
	
	
КонецФункции

&НаКлиенте
Процедура ЗагружаемИзображенияПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПутьККаталогуИзображенийПриИзменении(Элемент)
	Файл = Новый Файл(ПутьККаталогуИзображений);
	
	Оповещение = Новый ОписаниеОповещения("ПутьККаталогуИзображенийПослеПроверкиСуществования", ЭтотОбъект);
	Файл.НачатьПроверкуСуществования(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ПутьККаталогуИзображенийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборФайла(Элемент, ЭтотОбъект, "ПутьККаталогуИзображений", Истина, , Ложь, Истина);
КонецПроцедуры

// Открывает диалог выбора каталога.
&НаКлиенте
Процедура ВыборФайла(Элемент, ОбъектХранения, ИмяСвойства, ПроверятьСуществование, Знач РасширениеПоУмолчанию = "xml",
	АрхивироватьФайлДанных = Истина, ВыборФайлаПравил = Ложь)
	
	мДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОбъектХранения", ОбъектХранения);
	ДополнительныеПараметры.Вставить("ИмяСвойства",    ИмяСвойства);
	ДополнительныеПараметры.Вставить("Элемент",        Элемент);
	
	Оповещение = Новый ОписаниеОповещения("ДиалогВыбораФайлаОбработкаВыбора", ЭтотОбъект, ДополнительныеПараметры);
	мДиалогВыбораКаталога.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ДиалогВыбораФайлаОбработкаВыбора(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ОбъектХранения[ДополнительныеПараметры.ИмяСвойства] = ВыбранныеФайлы[0];
	
	Элемент = ДополнительныеПараметры.Элемент;
	
	ИмяФайлаПравилПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаПравилПриИзменении(Элемент)
	
	Файл = Новый Файл(ПутьККаталогуИзображений);
	
	Оповещение = Новый ОписаниеОповещения("ПутьККаталогуИзображенийПослеПроверкиСуществования", ЭтотОбъект);
	Файл.НачатьПроверкуСуществования(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьККаталогуИзображенийПослеПроверкиСуществования(Существует, ДополнительныеПараметры) Экспорт
	
	Если Не Существует Тогда
		СообщитьПользователю(НСтр("ru = 'Не найден каталог для обмена'"), "ПутьККаталогуИзображений");
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьККаталогуИзображенийОткрытие(Элемент, СтандартнаяОбработка)
	ОткрытьВПриложении(Элемент.ТекстРедактирования, СтандартнаяОбработка);
КонецПроцедуры


// Открывает файл обмена во внешнем приложении.
//
// Параметры:
//  
// 
&НаКлиенте
Процедура ОткрытьВПриложении(ИмяФайла, СтандартнаяОбработка = Ложь)
	
	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("ИмяФайла", ИмяФайла);
	ДополнительныеПараметры.Вставить("ОписаниеОповещения", Новый ОписаниеОповещения);
	
	Файл = Новый Файл();
	Файл.НачатьИнициализацию(Новый ОписаниеОповещения("ПроверитьСуществованиеФайла", ЭтотОбъект, ДополнительныеПараметры), ИмяФайла);
	
КонецПроцедуры
#КонецОбласти


#Область РаботаСФайломExcel

&НаКлиенте
Процедура ФайлExcelНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	мДиалогВыбораКаталога = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОбъектХранения", ЭтотОбъект);
	ДополнительныеПараметры.Вставить("ИмяСвойства",    "ФайлExcel");
	ДополнительныеПараметры.Вставить("Элемент",        Элемент);
	
	Оповещение = Новый ОписаниеОповещения("ДиалогВыбораФайлаExcel", ЭтотОбъект, ДополнительныеПараметры);
	мДиалогВыбораКаталога.Показать(Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ДиалогВыбораФайлаExcel(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ОбъектХранения[ДополнительныеПараметры.ИмяСвойства] = ВыбранныеФайлы[0];
	Элемент = ДополнительныеПараметры.Элемент;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлНаСервере(ФайлExcel)
	
	ВременныйТабличныйДокумент = Новый ТабличныйДокумент;
	
	Попытка 
	ВременныйТабличныйДокумент.Прочитать(ФайлExcel, СпособЧтенияЗначенийТабличногоДокумента.Значение);
	Исключение
		Сообщить(НСтр("ru = 'Ошибка открытия файла Microsoft Excel '") + ОписаниеОшибки());
		Возврат;
	КонецПопытки;
	
	КоличествоСтрок    = ВременныйТабличныйДокумент.ВысотаТаблицы;
	КоличествоКолонок  = ВременныйТабличныйДокумент.ШиринаТаблицы;
	
	Если (Excel1Строка > КоличествоСтрок) ИЛИ (Excel1Строка  <= 0) Тогда
		СообщитьПользователю(НСтр("ru = 'Не правильно указана первая строка с данными. '"), "Excel1Строка");
		Возврат;
	Конецесли;
	
	Если (ExcelАртикул > КоличествоКолонок) ИЛИ (ExcelАртикул  <= 0) Тогда
		СообщитьПользователю(НСтр("ru = 'Не правильно указана колонка с артикулом'"), "ExcelАртикул");
		Возврат;
	Конецесли;
	
	Если (ExcelНаименование > КоличествоКолонок) ИЛИ (ExcelНаименование  <= 0) Тогда
		СообщитьПользователю(НСтр("ru = 'Не правильно указана колонка с наименованием '"), "ExcelНаименование");
		Возврат;
	Конецесли;
	
	Если (ExcelГруппа > КоличествоКолонок) ИЛИ (ExcelГруппа <= 0) Тогда
		СообщитьПользователю(НСтр("ru = 'Не правильно указана колонка с группой'"), "ExcelГруппа");
		Возврат;
	Конецесли;
	
	Результат = ОбработатьДанныеТабличногоДокумента(ВременныйТабличныйДокумент, КоличествоСтрок);
	
КонецПроцедуры

&НаСервере
Функция ОбработатьДанные(Данные, КоличествоСтрок)
	
	ИнициализироватьТабличныйДокумент();
	
	НомерСтроки = 2;
	Для НомерС=Excel1Строка По КоличествоСтрок-1 Цикл

		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		
		Если ExcelАртикул>0 Тогда
			Если НЕ ЗначениеЗаполнено(СокрЛП(Данные[ExcelАртикул-1][НомерС-1])) Тогда
				СообщитьПользователю(Формат(НомерС, "ЧН=0; ЧГ=0") + " - в этой строке пустой артикул! Строка пропущена.");
				Продолжить;
			КонецЕсли;
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C2").Текст = СокрЛП(Данные[ExcelАртикул-1][НомерС-1]); //"КолонкаАртикул"
		КонецЕсли;
		Если ExcelНаименование>0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C4").Текст = СокрЛП(Данные[ExcelНаименование-1][НомерС-1]);//КолонкаНаименование
		КонецЕсли;
		Если ExcelНаименованиеПечати>0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C6").Текст = СокрЛП(Данные[ExcelНаименованиеПечати-1][НомерС-1]);//КолонкаЕдиницаИзмерения
		КонецЕсли;
		Если ExcelЕдиница>0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C5").Текст = СокрЛП(Данные[ExcelЕдиница-1][НомерС-1]);//КолонкаНаименованиДляПечати
		КонецЕсли;
		Если ExcelОписание>0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C9").Текст = СокрЛП(Данные[ExcelОписание-1][НомерС-1]);//КолонкаТекстовоеОписание
		КонецЕсли;
		Если ExcelГруппа>0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C10").Текст = СокрЛП(Данные[ExcelГруппа-1][НомерС-1]);//КолонкаГруппа
		КонецЕсли;
		Если ExcelЦена>0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C17").Текст = СокрЛП(Данные[ExcelЦена-1][НомерС-1]);//КолонкаГруппа
		КонецЕсли;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

КонецФункции

&НаСервере
Функция ОбработатьДанныеТабличногоДокумента(ТабличныйДокумент, КоличествоСтрок)
	
	ИнициализироватьТабличныйДокумент();
	
	НомерСтроки = 2;
	Для НомерС=Excel1Строка По КоличествоСтрок-1 Цикл

		СтроковыйНомер = Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		
		Если ExcelАртикул>0 Тогда
			Если НЕ ЗначениеЗаполнено(ПолучитьЗначениеЯчейки(ТабличныйДокумент,НомерС,ExcelАртикул)) Тогда
				СообщитьПользователю(Формат(НомерС, "ЧН=0; ЧГ=0") + " - в этой строке пустой артикул! Строка пропущена.");
				Продолжить;
			КонецЕсли;
			//КолонкаАртикул
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C2").Текст = ПолучитьЗначениеЯчейки(ТабличныйДокумент,НомерС,ExcelАртикул); 
		КонецЕсли;
		
		//КолонкаНаименование
		Если ExcelНаименование > 0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C4").Текст = ПолучитьЗначениеЯчейки(ТабличныйДокумент,НомерС,ExcelНаименование);
		КонецЕсли;
		
		//КолонкаНаименованиеПечати
		Если ExcelНаименованиеПечати > 0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C5").Текст = ПолучитьЗначениеЯчейки(ТабличныйДокумент,НомерС,ExcelНаименованиеПечати);
		КонецЕсли;
		
		//КолонкаЕдиница
		Если ExcelЕдиница > 0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C6").Текст = ПолучитьЗначениеЯчейки(ТабличныйДокумент,НомерС,ExcelЕдиница);
		КонецЕсли;
		
		//КолонкаОписание
		Если ExcelОписание > 0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C9").Текст = ПолучитьЗначениеЯчейки(ТабличныйДокумент,НомерС,ExcelОписание);
		КонецЕсли;
		
		//КолонкаГруппа
		Если ExcelГруппа > 0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C10").Текст = ПолучитьЗначениеЯчейки(ТабличныйДокумент,НомерС,ExcelГруппа);
		КонецЕсли;
		
		//КолонкаЦена
		Если ExcelЦена > 0 Тогда
			ДанныеДляЗагрузки.Область("R" + СтроковыйНомер + "C17").Текст = ПолучитьЗначениеЯчейки(ТабличныйДокумент,НомерС,ExcelЦена);
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;

КонецФункции

&НаСервере
Функция ПолучитьЗначениеЯчейки(ТабличныйДокумент, НомерСтроки, НомерСтолбца)
	Возврат Строка(ТабличныйДокумент.ПолучитьОбласть("R" +  Формат(НомерСтроки, "ЧГ=0") + "C"+ НомерСтолбца).ТекущаяОбласть.Текст);
КонецФункции 


&НаКлиенте
Процедура ПрочитатьФайл(Команда)
	ОчиститьСообщения();
	АдресФайлаВоВременномХранилище = "";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗагрузитьДанныеЗавершение", ЭтотОбъект);
	НачатьПомещениеФайла(ОписаниеОповещения, АдресФайлаВоВременномХранилище,,,УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьДанныеЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДополнительныеПараметры) Экспорт
	
	Если Результат Тогда
		
		Состояние(Нстр("ru = 'Выполняется загрузка данных. Пожалуйста, подождите...'"));
		
		Файл = Новый Файл(ФайлExcel);
		Если Не Файл.Существует() Тогда
			
			ТекстСообщения = Нстр("ru = 'Указанный файл не существует'");
			ПутьКДанным = ?(Истина, "", "ИмяФайлаЗагрузки");
			СообщитьПользователю(ТекстСообщения, ПутьКДанным);
			Возврат;
			
		КонецЕсли;
		
		ЗагрузитьДанныеНаСервере(Адрес, Файл.Расширение);
	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьДанныеНаСервере(АдресФайлаВоВременномХранилище, Расширение)

		
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайлаВоВременномХранилище);
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
		ДвоичныеДанные.Записать(ИмяВременногоФайла);
		
		ПрочитатьФайлНаСервере(ИмяВременногоФайла);
		
		Файл = Новый Файл(ИмяВременногоФайла);
		
		Если Файл.Существует() Тогда
			
			УдалитьФайлы(ИмяВременногоФайла);
			
		КонецЕсли;
		

КонецПроцедуры

#КонецОбласти
